In [50]:
import pandas as pd
people={
    "first":["Corey","Jane","John"],
    "last":["Schafer","Doe","Doe"],
    "email":["coreyschafer@gmail.com","janedoe@gmail.com","johndoe@gmail.com"]
}
df=pd.DataFrame(people)
pd.set_option('display.max_columns',85)
pd.set_option('display.max_rows',85)

In [30]:
#to combine column
df['first'] + ' '+ df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [31]:
df['full_name']=df['first']+' '+df['last']

In [6]:
df

   first     last                   email      full name
0  Corey  Schafer  coreyschafer@gmail.com  Corey Schafer
1   Jane      Doe       janedoe@gmail.com       Jane Doe
2   John      Doe       johndoe@gmail.com       John Doe

In [32]:
#Removing the column if we are happy with output then we can put inplace attribute as true
df.drop(columns=['first','last'])

                    email      full_name
0  coreyschafer@gmail.com  Corey Schafer
1       janedoe@gmail.com       Jane Doe
2       johndoe@gmail.com       John Doe

In [8]:
df

   first     last                   email      full name
0  Corey  Schafer  coreyschafer@gmail.com  Corey Schafer
1   Jane      Doe       janedoe@gmail.com       Jane Doe
2   John      Doe       johndoe@gmail.com       John Doe

In [33]:
#Removing the column if we are happy with output then we can put inplace attribute as true
df.drop(columns=['first','last'],inplace=True)

In [34]:
df

                    email      full_name
0  coreyschafer@gmail.com  Corey Schafer
1       janedoe@gmail.com       Jane Doe
2       johndoe@gmail.com       John Doe

In [35]:
df['full_name'].str.split(" ")  #be default it split with space

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [38]:
#to apply the it table we have to use expand command
df['full_name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [39]:
df[['first','last']]=df['full_name'].str.split(' ',expand=True)

In [40]:
df

                    email      full_name  first     last
0  coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
1       janedoe@gmail.com       Jane Doe   Jane      Doe
2       johndoe@gmail.com       John Doe   John      Doe

In [43]:
#To add single row of data
df._append({'first':'Tony'}, ignore_index=True)

                    email      full_name  first     last
0  coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
1       janedoe@gmail.com       Jane Doe   Jane      Doe
2       johndoe@gmail.com       John Doe   John      Doe
3                     NaN            NaN   Tony      NaN

In [44]:
df

                    email      full_name  first     last
0  coreyschafer@gmail.com  Corey Schafer  Corey  Schafer
1       janedoe@gmail.com       Jane Doe   Jane      Doe
2       johndoe@gmail.com       John Doe   John      Doe

In [51]:
people={
    "first":["Tony","Steve"],
    "last":["Stark","Rogers"],
    "email":["IronMan@avenge.com","Cap@avenge.com"]
}
df2=pd.DataFrame(people)

In [52]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [54]:
df._append(df2,ignore_index=True,sort=False)

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com
3   Tony    Stark      IronMan@avenge.com
4  Steve   Rogers          Cap@avenge.com

In [55]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [56]:
df=df._append(df2,ignore_index=True,sort=False)

In [57]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com
3   Tony    Stark      IronMan@avenge.com
4  Steve   Rogers          Cap@avenge.com

In [58]:
#Removing row
df.drop(4)  #df.drop(index=4)

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com
3   Tony    Stark      IronMan@avenge.com

In [60]:
filt=df['last']=='Doe'
df.drop(index=df[filt].index) #same as df.drop(index=df[df['last']=='Doe'].index)

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
3   Tony    Stark      IronMan@avenge.com
4  Steve   Rogers          Cap@avenge.com